[
    {
        "id": 1,
        "title": "METAL PUNCHING WORK",
        "description": "General Hydraulics Solution metal punching work service is ideal for creating precise holes and shapes in metal components.",
        "html":"<p>By applying pressure or percussion to a surface using a steel punch tool, the process of metal punching leaves an imprint of a shape. By using a strong enough cutting force, a piece of sheet metal is punched to remove the material from it. Steel, iron, copper, and aluminium are some of the numerous metals that may be pierced. Each material hardness varies, thus sufficient pressure is required to conduct punching without errors. To produce precise metal pieces, sheet metal up to 25 mm thick can be cut and pierced as per order at our premises. When the applied stress exceeds the material's shear strength, the punch's pressure on the sheet metal first causes plastic deformation of the material. This is followed by a severing of the material's fibrous structure, which is typical of sheet metal, which causes the part to physically separate from the tool.</p><p>We are always prepared to consider any enquiry from clients looking to establish a potential commercial relationship with us and benefit from our knowledge in metal punching and forming. We typically focus on medium- and large-sized structured businesses that operate both in the Indian and global markets.</p>",
        "imageUrl": "/Assets/MetalPunchingBg.jpg"
    },
    {
        "id": 2,
        "title": "MACHINING",
        "description": "General Hydraulics Solution operates a state-of-the-art machine shop capable of manufacturing steel components for any practical application.",
        "html":"<p>Any procedure that involves using a cutting tool to remove tiny pieces of material from the workpiece is known as machining. Relative motion between the tool and the job is necessary for the operation to be completed. Most machining operations use a main motion termed “cutting speed” and a secondary motion called “feed” to produce this relative motion. These movements together with the tool's design and its penetration into the work surface result in the desired shape of the finished work surface.</p><ul><li>1. Turning</li><li>2. Milling</li><li>3. Drilling</li><li>4. Boring</li></ul>",
        "imageUrl": "/Assets/machiningBg.webp"
    },
    {
        "id": 3,
        "title": "WELDING",
        "description": "General Hydraulics Solution provides fully certified welding services of the highest quality and our skilled artisans will create the perfect weld.",
        "html":"<p>A connect is formed as two or more components cool during the welding process, which involves the use of heat, pressure, or both. The most common materials for welding are metals and thermoplastics, however wood can also be utilised. A weldment is the term used to describe the finished welded junction.</p><p>Certain materials need the employment of particular procedures and methods. A few are deemed “unweldable,” a phrase that is helpful and descriptive in engineering but is rarely seen in dictionaries.</p><p>A parent material is the term for the pieces that are linked. Filler or consumable refers to the substance that is introduced to the join to aid in its formation. These materials may be known by several names depending on their shape, including parent plate or pipe, filler wire, consumable electrode etc..</p><p>Consumables are often chosen to have a composition that is comparable to the parent material in order to create a homogeneous weld, however there are times when a filler with a significantly different composition and therefore, qualities is employed, such as when welding brittle cast irons. Heterogeneous describes these welds. A “weldment” is the term used to describe the finished welded junction.</p><p>There are a variety of typical manual, semi-automated, and automatic procedures in this area that we can assist you with. These include stick welding, gas welding, metal inert gas (MIG) welding, tungsten inert gas (TIG) welding (also known as gas tungsten arc welding, or GTAW), shielded metal arc welding (SMAW).</p><p>Stainless steel, aluminium, nickel and copper alloys, cobalt and titanium are just a few of the metals that may be joined using these methods, which often include the use of a filler material. Several different sectors, including oil and gas, power, aerospace, automotive, and others, employ arc welding procedures extensively.<p>",
        "imageUrl": "/Assets/weldingBg.webp"
    },
    {
        "id": 4,
        "title": "FLAME CUTTING",
        "description": "General Hydraulics Solution has expanded its service capacity to include plasma and flame cutting. Get high quality plasma cuts through any  conductive metal.",
        "html":"<p>Flame cutting, also known as oxy-fuel cutting, is an oxygen cutting technique used to separate and shape steel components by heating the appropriate portion of the material to be cut to ignition temperature. During the process, oxygen and a fuel gas (such as acetylene, propane, or mains gas) are passed via a torch. The steel surface is heated using an outer ring of jets in the torch nozzle. From a central jet, a separate oxygen stream is focused onto the region to be sliced. Steel quickly oxidises, and substance is eliminated by the pressure of the gases. The procedure can be carried out manually, with the operator holding and directing the cutting torch, or mechanically, with the torch mounted on a machine. Complex form cutting is feasible. Using computer technology, cutting machines may be pre-programmed to save material waste while cutting a plate. There are machines with many cutting heads for big volume manufacturing needs.</p><p>We are always prepared to consider any enquiry from clients looking to establish a potential commercial relationship with us and benefit from our knowledge in Turning and all the other mentioned categories of machining. We typically focus on medium- and large-sized structured businesses that operate both in the Indian and global markets.</p>",
        "imageUrl": "/Assets/flameCuttingBg.webp"
    },
    {
        "id": 5,
        "title": "REPAIRS",
        "description": "At General Hydraulics Solution, we offer expert hydraulic equipment repair services, ensuring your machinery is up and running as soon as possible.",
        "html":"<br/><h3><strong>Inhouse Manufacturing products:</strong></h3><hr className:'w-25'/><p>Repair work is one of our strengths in terms of our service offering, right next to the production of our potent products. At GHS, we offer repair programmes for all of our manufacturing products and out-of-warranty components. We also provide onsite support when necessary.</p><br/><h3><strong>Hydraulic Pumps and Motors Repairs:</strong></h3><hr className:'w-25'/><p>The lifespan of various hydraulic equipment is significantly increased by hydraulic motor and pump maintenance services. The execution of the services is done at a regulated temperature while adhering to the necessary safety standards and regulations. These services are necessary to prevent unexpected system failure and to lower the rate of machine breakdowns.</p><p>We are always prepared to consider any enquiry from clients looking to establish a potential commercial relationship with us and benefit from our knowledge in various categories of hydraulic pumps and motors repairing. We typically focus on medium- and large-sized structured businesses that operate both in the Indian and global markets.</p><br/><h3><strong>Gear Box:</strong></h3><hr className:'w-25'/><p>Gearboxes are complex pieces of equipment that need to be fitted and maintained with extreme care. It's crucial to make sure the necessary measures are taken and in the proper order if you need to have your gearbox fixed. We are obligated to deliver results that need to be optimised to improve machine performance and longevity due to our years of experience in repair and service techniques. With experience, we now know the precise procedures for servicing gearboxes and fixing equipment, which will reduce downtime, costs, and inspection mistakes for you.</p>",
        "imageUrl": "/Assets/repairBg.webp"
    }
]